/*
задача 3
Напишите программу, которая будет выдавать 
название дня недели по заданному номеру.
1 -> Понедельник 
2 -> Вторник
3 -> Среда
4 -> Четверг 
5 -> Пятница
6 -> Суббота
7 -> Воскресенье
*/

Console.WriteLine("Hello, World!");
