/*
Задача 17

Напишите программу, которая принимает 
на вход координаты точки (X и Y), причём 
X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
в которой находится эта точка.
          y
 (2)      |      (1)
      -x  |  +x
      +y  |  +y
----------|----------> x
      -x  |  +x
      -y  |  -y
 (3)      |      (4)
*/

Console.WriteLine("Привет!");
